Update Readme with Mermaid diagram
